[
  {
    "name": "Patrick Barry",
    "role": "Board Member",
    "title": "Head of Facilitator Engagement",
    "location": "Pittsburgh, PA, USA",
    "link": "",
    "photo": "images/board/patrick.png",
    "bio": "Patrick started and runs a Stoa in Pittsburgh, where he lives with his wife and two children. He has a background in science and worked for 10 years as a science journalist, before changing careers to software development. He currently works for the Waking Up meditation app."
  },
  {
    "name": "Joe Bullock",
    "role": "Board Member",
    "title": "Head of Partnerships",
    "location": "Philadelphia, PA, USA",
    "link": "https://philadelphiastoa.org/joe-bullock/",
    "photo": "images/board/joe.jpg",
    "bio": "Joe Bullock's journey with Stoicism not only changed his life but also inspired him to co-found the Philadelphia Stoa. He organized the first live Stoicon-X in Philadelphia.<br><br>Read more or contact him at <a href=\"https://philadelphiastoa.org/joe-bullock/\" target=\"_blank\">philadelphiastoa.org/joe-bullock</a>."
  },
  {
    "name": "Nick Guggenbuehl",
    "role": "Board Member",
    "title": "Co-Founder & President",
    "location": "St. Paul, MN, USA",
    "link": "https://nickguggen.com",
    "photo": "images/board/nick_pic.jpg",
    "bio": "Nick Guggenbuehl is a social entrepreneur with an academic background aimed at the intersection of neuroscience and philosophy. He founded the Minnesota Stoics, co-founded The Stoic Fellowship, and is happiest when he’s hiking amidst a forest of pines or in the act of creating something new, be it a business, piece of music, or batch of home-brewed beer. Read more or contact him at <a href=\"https://nickguggen.com\" target=\"blank\" >https://nickguggen.com</a>."
  },
  {
    "name": "Dan Lampert",
    "role": "Board Member",
    "title": "Advisor",
    "location": "Orlando, FL, USA",
    "link": "https://www.linkedin.com/in/danlampert1",
    "photo": "images/board/dan.jpg",
    "bio": "Dan (aka \"StoicDan\") is a public speaker on Stoicism, Buddhism, Taoism, Humanism, Minimalism, and American Transcendentalism. Organizer of Orlando Stoics and past organizer at 10 philosophy groups. Presented at 7 Stoicons. Themes (goals) are: critical thinking, civil discourse, common ground."
  },
  {
    "name": "Gregory Lopez",
    "role": "Board Member",
    "title": "Co-Founder & Secretary",
    "location": "New York, NY, USA",
    "link": "https://greglopez.me/",
    "photo": "images/board/greg.jpeg",
    "bio": "Gregory Lopez is the founder and facilitator of the New York City Stoics, co-founder of The Stoic Fellowship, co-host of Stoic Camp New York, and on the team at Modern Stoicism. He is also co-author of A Handbook for New Stoics with Massimo Pigliucci. You can find out more about him at <a href=\"https://greglopez.me\" target=\"blank\" >https://greglopez.me</a>."
  },
  {
    "name": "James Kostecka",
    "role": "Board Member Emeritus",
    "title": "Co-Founder",
    "location": "Fremont, CA, USA",
    "link": "https://www.intergalactic.school/",
    "photo": "images/board/james.jpeg",
    "bio": "James Kostecka, F.C.S.P., is a mentor at the College of Stoic Philosophers as well as co-founder of the Redwood Stoa, Stoic Fellowship, and <a href=\"https://www.intergalactic.school/\" target=\"blank\" >Intergalactic Stoic School</a>. He is currently an active member of the Fremont Stoa, Regional Support Volunteer for West Coast, U.S.A., and a board member at The Stoic Fellowship. James's current projects include curriculum development at Intergalactic and supporting the <a href=\"https://docs.google.com/document/d/1meLizSBnjnuZG4r8hZB8hLsLZK37hcJ61s3NEF4rBfk/edit?usp=sharing\" target=\"blank\" >Stoic Fellowship Pioneers Program</a>."
  },
  {
    "name": "Michael Maune",
    "role": "Board Emeritus",
    "title": "",
    "location": "Boston, MA, USA",
    "link": "https://michaelmaune.com/",
    "photo": "images/board/michael.jpeg",
    "bio": "Michael Maune is Secretary and Curriculum Director of the New England Stoics. He has served as an organizer for Stoicon-X New England and Stoic Practicum. He writes occasionally about Stoicism on his blog, <a href=\"https://apersonfirst.substack.com/\">A Person First</a>. Michael holds his Ph.D. in English Education and Educational Linguistics and is a communication instructor and researcher at MIT."
  },
  {
    "name": "Pete Fagella",
    "role": "Board Emeritus",
    "title": "",
    "location": "Boston, MA, USA",
    "link": "https://www.nestoics.org",
    "photo": "images/board/pete2.png",
    "bio": "In addition to being a board member, Pete also serves as the President of the New England Stoics. He is an active pilot with the Civil Air Patrol and the Franconia Soaring Association. He flies everything from gliders to high performance single engine aircraft. He also has two teenage sons with whom he spends quite a lot of time. In his capacity as a director of the board, he is responsible for the organization of Stoicon-x events around the world."
  },
  {
    "name": "Justin Kitchen",
    "role": "Board Emeritus",
    "title": "",
    "location": "Los Angeles, CA, USA",
    "link": "https://academics.csun.edu/faculty/justin.kitchen",
    "photo": "images/board/justin.jpg",
    "bio": "Justin graduated with a B.A. in Philosophy and Religion and an M.A. in Philosophy from San Francisco State University. He has been teaching philosophy at SF State and Cal State Northridge since 2014 and 2016, respectively. His interests span virtue ethics, virtue epistemology, Indian philosophy, and Ancient Hellenistic philosophy. Justin integrates the 'philosophy as a way of life' approach into his courses, provoking inquiry into the good life, engaging with a diversity of perspectives, encouraging student-led discussions, and testing the practical dimensions of the theories studied."
  },
  {
    "name": "Massimo Pigliucci",
    "role": "Board Emeritus",
    "title": "",
    "location": "New York, NY, USA",
    "link": "https://figsinwintertime.substack.com/",
    "photo": "images/board/massimo.jpeg",
    "bio": "Massimo Pigliucci is an author, blogger, podcaster, as well as the K.D. Irani Professor of Philosophy at the City College of New York. His academic work is in evolutionary biology, philosophy of science, the nature of pseudoscience, and the practical philosophy of Stoicism. He is the author of How to Be a Stoic: Using Ancient Philosophy to Live a Modern Life (Basic Books) and his most recent book is Think like a Stoic: Ancient Wisdom for Today’s World (Teaching Company / Audible). More by Massimo at his blog, <a href=\"https://figsinwintertime.substack.com/\" target=\"_blank\">Figs in Winter</a>."
  },
  {
    "name": "Juan Pérez",
    "role": "Board Emeritus",
    "title": "",
    "location": "Guadalajara, Mexico",
    "link": "",
    "photo": "images/board/juan.jpeg",
    "bio": "Juan Pérez is an author, podcaster, and co-founder and Sr. Change Manager at Axia Stoic Management. He founded the group <a href=\"https://www.facebook.com/groups/478740189519819/about/\" target=\"_blank\">Estoicismo Práctico</a> in Guadalajara, Mexico. He is a business consultant, entrepreneur and organizational psychologist that enjoys his time creating new projects, reading, playing music and sharing time with his two kids and wife. Juan's current goal is to share Stoicism with vulnerable groups of young people in Mexico."
  },
  {
    "name": "Brittany Polat",
    "role": "Board Emeritus",
    "title": "",
    "location": "Tampa Bay, FL, USA",
    "link": "https://substack.com/@brittanypolat",
    "photo": "images/board/brittany.jpeg",
    "bio": "Brittany Polat is co-founder of <a href=\"http://www.stoicare.com/\" target=\"_blank\">Stoicare</a>, an organization that shares Stoicism with everyone who cares about other people and our beautiful planet. She is also a member of the Modern Stoicism team and frequently contributes talks, interviews, and articles to the worldwide Stoic community. Brittany holds a Ph.D. in applied linguistics. You can read more of her thoughts on humanist Stoicism, human nature, and moral psychology at <a href=\"http://www.livinginagreement.com/\" target=\"_blank\">Living in Agreement</a>."
  },
  {
    "name": "Kellys Rodriguez",
    "role": "Board Emeritus",
    "title": "",
    "location": "Madrid, Spain",
    "link": "https://www.stoamadrid.es/",
    "photo": "images/board/kellys.jpg",
    "bio": "Kellys Rodriguez is the founder of <a href=\"https://www.stoamadrid.es/\">Stoa Madrid</a>, a school and community of Stoic philosophy based in Madrid (Spain) that aims to promote Stoicism's practical approach to learn and cultivate the art of living a good life. She’s also a member of our Social Service and Care team. Since 2018, she has organized activities for the Spanish-speaking Stoic community including online and in-person Stoic trainings, meetups, webinars, immersions, talks, Stoic hikes and get-togethers, group challenges, as well as social volunteering activities. Kellys has an academic and professional background in Economics and is the first South-American – Spanish member of our board."
  },
  {
    "name": "Mike Brooks",
    "role": "Volunteer",
    "title": "SFN Community Lead",
    "location": "Las Vegas, NV, USA",
    "link": "http://mabrooks.com/",
    "photo": "images/volunteers/mike_brooks.png",
    "bio": "Michael Brooks is one of the founding members of Vegas Stoics. He’s a former Air Force C-130 pilot, an amateur artist, and a lifelong learner. Since joining the Stoic Fellowship Network in 2024, he has found ways to continue his life of service, filling leadership roles in two book clubs and starting the first year-long guided practice for Stoic progressors."
  },
  {
    "name": "Edgar Jackson",
    "role": "Volunteer",
    "title": "SFN Community Lead",
    "location": "France",
    "link": "https://therationalcosmos.substack.com/",
    "photo": "images/volunteers/edgar_jackson.png",
    "bio": "Though I now live a life deeply connected to the land. I did not always follow this path. In my mid-thirties, faced with what I saw as a broken world and difficult personal circumstances. I too... broke. I left behind a busy city life and the comfort of convenience. And moved to rural France. <br><br>Now, with three grown children. Our lives here in the French countryside are simple. A simplicity shaped by the land around us. We grow our own vegetables. Keep a few animals. And heat our home with wood. Living this way, we have become about 85 percent self-sufficient. Relying on the terrain and our own hard work for most of our needs. <br><br>Life here is basic but rich. Writing is my true passion. Whenever I am not tending to the animals or the garden. You will find me immersed in words. My love for history runs deep. It has naturally shaped my writing, sometimes by weaving historical facts into fiction, sometimes through rediscovering old folklore. I find endless stories waiting to be told. <br><br>It was through those stories. And the kind of hardship we experienced (partly self-imposed and not expected but too often the case in the western world). That Stoicism became a central part of my life. It has been shaped by a connection to nature. And a compassion for my fellow human beings."
  }
]
